<?php
    class UTMTags {

        const UTM_SOURCE  = "utm_source";
        const UTM_TERM    = "utm_term";
        const UTM_MEDIUM  = "utm_medium";
        const UTM_CONTENT = "utm_content";

        protected static $utms_ = array();

        protected static $utms = [
            self::UTM_SOURCE   => self::UTM_SOURCE,
            self::UTM_TERM     => self::UTM_TERM,
            self::UTM_MEDIUM   => self::UTM_MEDIUM,
            self::UTM_CONTENT  => self::UTM_CONTENT
        ];

        public function __construct(){
            self::$utms_[self::UTM_SOURCE]  = self::UTM_SOURCE;
            self::$utms_[self::UTM_TERM]    = self::UTM_TERM;
            self::$utms_[self::UTM_MEDIUM]  = self::UTM_MEDIUM;
            self::$utms_[self::UTM_CONTENT] = self::UTM_CONTENT;
        }

        public static function getUtm($utm = self::UTM_SOURCE)
        {
            return self::$utms[$utm];
        }

        public static function setUtm($utm = self::UTM_SOURCE, $utm_value = self::UTM_SOURCE)
        {
            self::$utms[$utm] = $utm_value;
        }
    }
?>

<?php

    $dynamic_keywords = array(
        'фрунзенск' => "Минск, Фрунзенский р-н – 2 центра",
        'советск' => "Минск, Советский р-н – ул. Богдановича, 68А",
        'первомайск' => "Минск, Первомайский р-н – 3 центра",
        'центральн' => "Минск, Центральный р-н – пр. Победителей, 109",
        'партизанск' => "Минск, Партизанский р-н – ул. Радиальная, 36",
        'октябрьск' => "Минск, Октябрьский р-н – ул. Асаналиева, 16",
        'заводск' => "Минск, Заводской р-н – 4 центра",
        'московск' => "Минск, Московский р-н – ул. Слободская, 169",
        'минск' => "в Минске",
        /* - */
        'борисовск' => "Минск, ст. м. Борисовский тракт",
        'челюскинц' => "Минск, ст. м. Парк Челюскинцев",
        'академи' => "Минск, ст. м. Академия наук",
        'коласа' => "Минск, ст. м. Площадь Якуба Коласа",
        'победы' => "Минск, ст. м. Площадь Победы",
        'ленин' => "Минск, ст. м. Площадь Ленина",
        'независимос' => "Минск, ст. м. Независимости",
        'культур' => "Минск, ст. м. Институт Культуры",
        /* - */
        'ванеев' => "Минск, ул. Ванеева, 1",
        'герасименк' => "Минск, ул. Герасименко, 10",
        'илимск' => "Минск, ул. Илимская, 15",
        'уборевич' => "Минск, ул. Уборевича, 124А",
        'слободск' => "Минск, ул. Слободская, 169",
        'асаналиев' => "Минск, ул. Асаналиева, 16",
        'радиальн' => "Минск, ул. Радиальная, 36",
        'победител' => "Минск, пр. Победителей, 109",
        'калиновск' => "Минск, ул. Калиновского, 55",
        'козлов' => "Минск, ул. Козлова, 17А",
        'седых' => "Минск, ул. Седых, 66",
        'богданович' => "Минск, ул. Богдановича, 68А",
        'чайлытк' => "Минск, ул. Чайлытко, 8",
        'шарангович' => "Минск, ул. Шаранговича, 68",
        /* - */
        'запад' => "Минск, Юго-Запад",
        'сухарев' => "Минск, Сухарево",
        'брилевич' => "Минск, Брилевичи",
        'луг' => "Минск, Зелёный Луг",
        'серебрянк' => "Минск, Серебрянка",
        'чижовк' => "Минск, Чижовка",
        'шабан' => "Минск, Шабаны",
        'курасовщин' => "Минск, Курасовщина",
        'веснянк' => "Минск, Веснянка",
        'лошиц' => "Минск, Лошица",
        'ангар' => "Минск, Ангарская",
        'маяков' => "Минск, Маяковского",
        'уруч' => "Минск, Уручье",
        'восток' => "Минск, Восток",
        'грушевк' => "Минск, Грушевка",
        'михалов' => "Минск, Михалово",
        'петровщин' => "Минск, Петровщина",
        'малиновк' => "Минск, Малиновка"
    );

    $utm_array = array (
        UTMTags::getUtm(UTMTags::UTM_TERM),
        UTMTags::getUtm(UTMTags::UTM_CONTENT)
    );
?>
