<?php
    class UTMTags {

        const UTM_SOURCE  = "utm_source";
        const UTM_TERM    = "utm_term";
        const UTM_MEDIUM  = "utm_medium";
        const UTM_CONTENT = "utm_content";

        protected static $utms_ = array();

        protected static $utms = [
            self::UTM_SOURCE   => self::UTM_SOURCE,
            self::UTM_TERM     => self::UTM_TERM,
            self::UTM_MEDIUM   => self::UTM_MEDIUM,
            self::UTM_CONTENT  => self::UTM_CONTENT
        ];

        public function __construct(){
            self::$utms_[self::UTM_SOURCE]  = self::UTM_SOURCE;
            self::$utms_[self::UTM_TERM]    = self::UTM_TERM;
            self::$utms_[self::UTM_MEDIUM]  = self::UTM_MEDIUM;
            self::$utms_[self::UTM_CONTENT] = self::UTM_CONTENT;
        }

        public static function getUtm($utm = self::UTM_SOURCE)
        {
            return self::$utms[$utm];
        }

        public static function setUtm($utm = self::UTM_SOURCE, $utm_value = self::UTM_SOURCE)
        {
            self::$utms[$utm] = $utm_value;
        }
    }
?>

<?php

    $dynamic_keywords = array (
        /* _term */
        'заводск' => "Минск, Заводской р-н – 5 центров",
        'московский' => "Минск, Московский р-н – ул. Слободская, 169",
        'московском' => "Минск, Московский р-н – ул. Слободская, 169",
        'октябрьский' => "Минск, Октябрьский р-н – 2 центра",
        'октябрьском' => "Минск, Октябрьский р-н – 2 центра",
        'партизанск' => "Минск, Партизанский р-н – ул. Радиальная, 36",
        'первомайск' => "Минск, Первомайский р-н – 4 центра",
        'советск' => "Минск, Советский р-н – 3 центра",
        'фрунзенск' => "Минск, Фрунзенский р-н – 2 центра",
        'центральн' => "Минск, Центральный р-н – пр. Победителей, 109",
        'минск' => "в Минске",
        /* _content */
        'Zavodskoy_rayon' => "Минск, Заводской р-н – 5 центров",
        'Moskovskiy_rayon' => "Минск, Московский р-н – ул. Слободская, 169",
        'Moskovskom_rayone' => "Минск, Московский р-н – ул. Слободская, 169",
        'Oktyabrskiy_rayon' => "Минск, Октябрьский р-н – 2 центра",
        'Oktyabrskom_rayone' => "Минск, Октябрьский р-н – 2 центра",
        'Partizanskiy_rayon' => "Минск, Партизанский р-н – ул. Радиальная, 36",
        'Pervomayskiy_rayon' => "Минск, Первомайский р-н – 4 центра",
        'Sovetskiy_rayon' => "Минск, Советский р-н – 2 центра",
        'Frunzenskiy_rayon' => "Минск, Фрунзенский р-н – 2 центра",
        'Tsentralnyiy_rayon' => "Минск, Центральный р-н – пр. Победителей, 109",
        'Minsk' => "в Минске",
        /* - */
        /* - */
        /* _term */
        'борисовск' => "Минск, ст. м. Борисовский тракт",
        'челюскинц' => "Минск, ст. м. Парк Челюскинцев",
        'академи' => "Минск, ст. м. Академия наук",
        'коласа' => "Минск, ст. м. пл. Якуба Коласа",
        'победы' => "Минск, ст. м. пл. Победы",
        'ленин' => "Минск, ст. м. пл. Ленина",
        'культур' => "Минск, ст. м. Институт Культуры",
        'московская' => "Минск, ст. м. Московская",
        'московской' => "Минск, ст. м. Московская",
        /* _content */
        'Borisovskiy_trakt' => "Минск, ст. м. Борисовский тракт",
        'Park_Chelyuskintsev' => "Минск, ст. м. Парк Челюскинцев",
        'Akademiya_nauk' => "Минск, ст. м. Академия наук",
        'Ploschad_Yakuba_Kolasa' => "Минск, ст. м. пл. Якуба Коласа",
        'Ploschad_Pobedyi' => "Минск, ст. м. пл. Победы",
        'Ploschad_Lenina' => "Минск, ст. м. пл. Ленина",
        'Institut_Kulturyi' => "Минск, ст. м. Институт Культуры",
        'Moskovskaya' => "Минск, ст. м. Московская",
        'Moskovskoy' => "Минск, ст. м. Московская",
        /* - */
        /* - */
        /* _term */
        'ванеев' => "Минск, ул. Ванеева, 1",
        'герасименк' => "Минск, ул. Герасименко, 10",
        'илимск' => "Минск, ул. Илимская, 15",
        'уборевич' => "Минск, ул. Уборевича, 124А",
        'слободск' => "Минск, ул. Слободская, 169",
        'асаналиев' => "Минск, ул. Асаналиева, 16",
        'радиальн' => "Минск, ул. Радиальная, 36",
        'победител' => "Минск, пр. Победителей, 109",
        'калиновск' => "Минск, ул. Калиновского, 55",
        'козлов' => "Минск, ул. Козлова, 17А",
        'седых' => "Минск, ул. Седых, 66",
        'богданович' => "Минск, ул. Богдановича, 68А, 76",
        'широк' => "Минск, ул. Широкая 14",
        'мазуров' => "Минск, ул. Мазурова, 6",
        'якубовск' => "Минск, ул. Якубовского, 46",
        'мстиславц' => "Минск, ул. Мстиславца, 20",
        'ландер' => "Минск, ул. Ландера, 120",
        'народн' => "Минск, ул. Народная 51",
        /* _content */
        'Vaneeva' => "Минск, ул. Ванеева, 1",
        'Gerasimenko' => "Минск, ул. Герасименко, 10",
        'Ilimskaya' => "Минск, ул. Илимская, 15",
        'Uborevicha' => "Минск, ул. Уборевича, 124А",
        'Slobodskaya' => "Минск, ул. Слободская, 169",
        'Asanalieva' => "Минск, ул. Асаналиева, 16",
        'Radialnaya' => "Минск, ул. Радиальная, 36",
        'Pobediteley' => "Минск, пр. Победителей, 109",
        'Kalinovskogo' => "Минск, ул. Калиновского, 55",
        'Kozlova' => "Минск, ул. Козлова, 17А",
        'Sedyih' => "Минск, ул. Седых, 66",
        'Bogdanovicha' => "Минск, ул. Богдановича, 68А, 76",
        'Shirokaya' => "Минск, ул. Широкая 14",
        'Mazurova' => "Минск, ул. Мазурова, 6",
        'Yakubovskogo' => "Минск, ул. Якубовского, 46",
        'Mstislavtsa' => "Минск, ул. Мстиславца, 20",
        'Landera' => "Минск, ул. Ландера, 120",
        'Narodnaya' => "Минск, ул. Народная 51",
        /* - */
        /* - */
        /* _term */
        'сухарев' => "Минск, Сухарево",
        'брилевич' => "Минск, Брилевичи",
        'луг' => "Минск, Зелёный Луг",
        'серебрянк' => "Минск, Серебрянка",
        'чижовк' => "Минск, Чижовка",
        'шабан' => "Минск, Шабаны",
        'курасовщин' => "Минск, Курасовщина",
        'веснянк' => "Минск, Веснянка",
        'лошиц' => "Минск, Лошица",
        'ангар' => "Минск, Ангарская",
        'маяков' => "Минск, Маяковского",
        'уруч' => "Минск, Уручье",
        'восток' => "Минск, Восток",
        'грушевк' => "Минск, Грушевка",
        'михалов' => "Минск, Михалово",
        'петровщин' => "Минск, Петровщина",
        'малиновк' => "Минск, Малиновка",
        'бор' => "Минск, Красный Бор",
        'юго' => "Минск, Юго-Запад",
        /* _content */
        'Suharevo' => "Минск, Сухарево",
        'Brilevichi' => "Минск, Брилевичи",
        'Zelyonyiy_Lug' => "Минск, Зелёный Луг",
        'Serebryanka' => "Минск, Серебрянка",
        'Chizhovka' => "Минск, Чижовка",
        'Shabanyi' => "Минск, Шабаны",
        'Kurasovschina' => "Минск, Курасовщина",
        'Vesnyanka' => "Минск, Веснянка",
        'Loshitsa' => "Минск, Лошица",
        'Angarskaya' => "Минск, Ангарская",
        'Mayakovskogo' => "Минск, Маяковского",
        'Uruche' => "Минск, Уручье",
        'Vostok' => "Минск, Восток",
        'Grushevka' => "Минск, Грушевка",
        'Mihalovo' => "Минск, Михалово",
        'Petrovschina' => "Минск, Петровщина",
        'Malinovka' => "Минск, Малиновка",
        'Krasniy_Bor' => "Минск, Красный Бор",
        'Yugo_Zapad' => "Минск, Юго-Запад"
    );

    $utm_array = array (
        UTMTags::getUtm(UTMTags::UTM_TERM),
        UTMTags::getUtm(UTMTags::UTM_CONTENT)
    );
?>
